Mod.org
#+TITLE: Quarks System Core (v.1.0.0) Annotated Source
#+AUTHOR: Chatman R. Jr
#+PROPERTY: header-args :mkdirp yes

* Table of Contents :TOC@3:
- [[#introduction][Introduction]]
- [[#entry-point][Entry Point]]
- [[#overview-of-system-design][Overview of System Design]]
- [[#schema][Schema]]
- [[#formatters][Formatters]]
  - [[#css-formats][CSS Formats]]
    - [[#custom-properties][Custom Properties]]
    - [[#preprocessors][Preprocessors]]
  - [[#data-exports][Data Exports]]
  - [[#desktop-support][Desktop Support]]
    - [[#gimpinkscape][GIMP/Inkscape]]
    - [[#sketch][Sketch]]
  - [[#interopintegration][Interop/Integration]]
- [[#bootstrapper][Bootstrapper]]
  - [[#quarks-system-standard][Quarks System Standard]]
- [[#formulas][Formulas]]
  - [[#palette-formulas][Palette Formulas]]
  - [[#typography-formulas][Typography Formulas]]
  - [[#layout-formulas][Layout Formulas]]
  - [[#animation-formulas][Animation Formulas]]
- [[#configurations][Configurations]]
  - [[#numeric-color-scale][Numeric Color Scale]]
  - [[#modular-scale-types][Modular Scale Types]]
- [[#utilities][Utilities]]
  - [[#functional-programming][Functional Programming]]
  - [[#color][Color]]
    - [[#color-conversion][Color Conversion]]
    - [[#color-format-comparison][Color Format Comparison]]
    - [[#color-property-adjustment][Color Property Adjustment]]
    - [[#color-mixture][Color Mixture]]
  - [[#color-scales-palettes][Color Scales (Palettes)]]
    - [[#interpolation][Interpolation]]
    - [[#blending][Blending]]
    - [[#material][Material]]
    - [[#color-schemes][Color Schemes]]
    - [[#variants][Variants]]
  - [[#color-scale-adjustments][Color Scale Adjustments]]
    - [[#palette-shifting][Palette Shifting]]
    - [[#palette-sorting][Palette Sorting]]
    - [[#palette-filtering][Palette Filtering]]
  - [[#color-accessibility-a11y][Color Accessibility (A11y)]]
    - [[#colors-project-web-defaults][Colors Project Web Defaults]]
    - [[#color-contrast-ratio][Color Contrast Ratio]]
  - [[#typography][Typography]]
    - [[#system-font-stacks][System Font Stacks]]
  - [[#modular-scales][Modular Scales]]
    - [[#scale-creation][Scale Creation]]
    - [[#scale-modification][Scale Modification]]
    - [[#attaching-units][Attaching Units]]
- [[#library][Library]]
  - [[#formatter-helpers][Formatter Helpers]]
    - [[#css-format-structure][CSS Format Structure]]
    - [[#undefined-project-metadata-error][Undefined Project Metadata Error]]
    - [[#metadata-emitter][Metadata Emitter]]
    - [[#token-string-constructor][Token String Constructor]]
    - [[#css-token-emitter][CSS Token Emitter]]
    - [[#css-token-assembler][CSS Token Assembler]]
    - [[#token-string-identifier][Token String Identifier]]
    - [[#automatic-versioning][Automatic Versioning]]
    - [[#timestamp-emitter][Timestamp Emitter]]
    - [[#yaml-assemblers][YAML Assemblers]]
  - [[#utilities-1][Utilities]]
    - [[#functional-programming-1][Functional Programming]]
    - [[#color-1][Color]]
  - [[#error-handling][Error Handling]]
  - [[#data][Data]]

* Introduction

* Entry Point
:PROPERTIES:
:header-args:js: :tangle "./mod.js" :comments link
:END:

#+BEGIN_SRC js
export * from "./formatters.js";
export * from "./bootstrapper.js";
export * from "./formulas.js";
export * from "./configurations.js";
export * from "./utilities.js";
#+END_SRC

* Overview of System Design

* Schema

* Formatters
:PROPERTIES:
:header-args:js: :tangle "./formatters.js" :comments link
:END:

#+BEGIN_SRC js
import {
  bumpVersion,
  cssFormatStructure,
  metadataEmitter,
  MissingProjectMetadataError,
  timestampEmitter,
  tokenStringIdentifier,
  yamlDictScale,
  yamlDictSubcategory,
  yamlDictValue,
} from "./lib/formatters/index.js";
import { extractor } from "./lib/utilities/color/extractor/index.js";
import { parser } from "./lib/utilities/color/parser/index.js";
import { color_to_hex, color_to_rgb, utility_pipe } from "./utilities.js";
#+END_SRC

** CSS Formats

*** Custom Properties

#+BEGIN_SRC js
export function output_css(dict) {
  return cssFormatStructure({}, dict);
}
#+END_SRC

*** Preprocessors

#+BEGIN_SRC js
export function output_scss(dict) {
  return cssFormatStructure(
    {
      doc: ["\n/*!", " */\n"],
      metadata: ["", "// ", "\n\n"],
      wrapper: ["", "\n"],
      opts: { padding: "", prefix: "$" },
    },
    dict,
  );
}
#+END_SRC

#+BEGIN_SRC js
export function output_less(dict) {
  return cssFormatStructure(
    {
      doc: ["\n/*", " */\n"],
      metadata: ["", "// ", "\n\n"],
      wrapper: ["", "\n"],
      opts: { padding: "", prefix: "@" },
    },
    dict,
  );
}
#+END_SRC

#+BEGIN_SRC js
export function output_styl(dict) {
  return cssFormatStructure(
    {
      doc: ["\n/*!", " */\n"],
      metadata: ["", "// ", "\n\n"],
      wrapper: ["", "\n"],
      opts: { padding: "", prefix: "", assignment: " = ", suffix: "" },
    },
    dict,
  );
}
#+END_SRC

** Data Exports

#+BEGIN_SRC js
export function output_raw(dict) {
  const { project, ...tokens } = dict;
  const { bump = "manual" } = project || MissingProjectMetadataError();

  // Check if bump matches an automation keyword
  const autobump = ["major", "minor", "patch", "pre", "build"].some(
    (keyword) => keyword === bump,
  );

  // Then bump the version
  autobump && bumpVersion(project);

  return JSON.stringify({ project, tokens }, null, 2);
}
#+END_SRC

#+BEGIN_SRC js
export function output_yaml(dict) {
  const { project, ...tokens } = dict;
  const { bump = "manual" } = project || MissingProjectMetadataError();

  // Check if bump matches an automation keyword
  const autobump = ["major", "minor", "patch", "pre", "build"].some(
    (keyword) => keyword === bump,
  );

  // Then bump the version
  autobump && bumpVersion(project);

  const assemble = (level, tree) =>
    Object.entries(tree).reduce((str, [key, data]) => {
      if (typeof data === "string") return yamlDictValue(level, str, key, data);
      if (Array.isArray(data)) return yamlDictScale(level, str, key, data);
      if (key === "base") return yamlDictSubcategory(level, data);
      return str.concat(
        "".padStart(level),
        key,
        ":\n",
        assemble(level + 2, data),
      );
    }, "");

  return `
# ${timestampEmitter()}
${
    Object.entries({ project, tokens })
      .reduce((str, [key, data]) => {
        if (typeof data === "string") return yamlDictValue(0, str, key, data);
        if (Array.isArray(data)) return yamlDictScale(0, str, key, data);
        if (key === "base") return yamlDictSubcategory(0, data);
        return str.concat("\n", key, ":\n", assemble(2, data));
      }, "")
      .trimEnd()
  }
`;
}
#+END_SRC

** Desktop Support

*** GIMP/Inkscape

#+BEGIN_SRC js
export function output_gpl(dict) {
  const {
    project,
    color: { metadata, ...palette },
  } = dict;
  let {
    name,
    author,
    version,
    license,
    bump = "manual",
    metadata: { description = "N/A", comments = "N/A" } = {},
  } = project || MissingProjectMetadataError();

  // Check if bump matches an automation keyword
  const autobump = ["major", "minor", "patch", "pre", "build"].some(
    (keyword) => keyword === bump,
  );
  // Then bump the version
  autobump && bumpVersion(project);

  const assemble = (head, node) =>
    Object.entries(node).reduce((str, [key, value]) => {
      const KEY = key.toUpperCase();

      if (typeof value === "object") {
        return str.concat(
          assemble(tokenStringIdentifier(head, KEY, " "), value),
        );
      }

      return str.concat(
        GIMPPaletteSwatch(value),
        "\t",
        tokenStringIdentifier(head, KEY, " "),
        ` (${color_to_hex(value)})`,
        "\n",
      );
    }, "");

  return `
GIMP Palette
Name: ${name} (v${version})
# Generator: Quarks System Core
# Owned by ${author}
# License: ${license}
${
    metadataEmitter(
      { commentDelim: ["#", "# ", "\n#"] },
      {
        description,
        comments,
      },
    )
  }
# ${timestampEmitter()}

Columns: 6
${assemble("", palette)}
`.trimStart();
}

function GIMPPaletteSwatch(color) {
  return utility_pipe(
    color,
    color_to_rgb,
    extractor,
    ([, components]) =>
      components
        .map((C) => C.padStart(3, " "))
        .slice(0, 3)
        .join("\t"),
  );
}
#+END_SRC

*** Sketch

#+BEGIN_SRC js
export function output_sketchpalette(dict) {
  const {
    project,
    color: { metadata, ...palette },
  } = dict;

  let {
    name,
    author,
    version,
    license,
    bump = "manual",
    metadata: { description = "N/A", comments = "N/A" } = {},
  } = project || MissingProjectMetadataError();

  const assemble = (tree) =>
    Object.values(tree)
      .map((data) => {
        if (Array.isArray(data)) {
          return data.map((color) => sketchSwatch(color)).flat();
        }

        if (typeof data === "object") {
          return assemble(data);
        }

        return sketchSwatch(data);
      })
      .flat();

  return JSON.stringify({
    colors: assemble(palette),
    pluginVersion: "1.4",
    compatibleVersion: "1.4",
  });
}

function sketchSwatch(color) {
  return utility_pipe(
    color,
    color_to_rgb,
    parser,
    ([, [red, green, blue, alpha]]) => ({
      red,
      green,
      blue,
      alpha,
    }),
  );
}
#+END_SRC

** Interop/Integration

#+BEGIN_SRC js
export function output_tailwindcss(dict) {
  const { project, ...tokens } = dict;

  const assemble = (node) =>
    Object.entries(node).reduce((acc, [key, data]) => {
      if (key === "base") return { ...acc, DEFAULT: data };

      // Skip past any metadata
      if (key === "metadata") return { ...acc };

      if (typeof data === "object") {
        return { ...acc, [key]: assemble(data) };
      }

      return { ...acc, [key]: data };
    }, {});

  return (project && assemble(tokens)) || MissingProjectMetadataError();
}

export function output_style_dictionary(dict) {
  const { project, ...tokens } = dict;

  const assemble = (node) =>
    Object.entries(node).reduce((acc, [key, data]) => {
      if (key === "metadata") return { ...acc };

      if (typeof data === "object") {
        return { ...acc, [key]: assemble(data) };
      }

      return { ...acc, [key]: { value: String(data) } };
    }, {});

  return (project && assemble(tokens)) || MissingProjectMetadataError();
}
#+END_SRC

* Bootstrapper
:PROPERTIES:
:header-args:js: :tangle "./bootstrapper.js" :comments link
:END:

#+BEGIN_SRC js
import {
  AnimationCubicBezier,
  AnimationDuration,
  FigureCalculations,
  GridDimensions,
  GridFractions,
  MaterialPalette,
  TextLeading,
  TextMeasure,
  TextSize,
  TextStack,
  TextStyle,
  TextUnits,
  Viewport,
} from "./formulas.js";
import { ms_create } from "./utilities.js";
#+END_SRC

