Mod.org
** Quarks System Standard

#+BEGIN_SRC js
export function Quarks({
  color = "gray",
  scale: { initial = 1, ratio = 1.5, limit = 6 } = {},
  tokens: {
    color: { formula = MaterialPalette, modifiers = {} } = {},
    text: {
      family: {
        body: BODY_FAMILY = null,
        headings: HEADING_FAMILY = null,
        code: CODE_FAMILY = null,
      } = {},
      fallback: {
        body: BODY_FALLBACK = "sans",
        headings: HEADING_FALLBACK = "serif",
        code: CODE_FALLBACK = "monospace",
      } = {},
      weights: {
        body: BODY_WEIGHTS = [400, 700],
        headings: HEADING_WEIGHTS = [700],
        code: CODE_WEIGHTS = BODY_WEIGHTS,
      } = {},
      measure: { min = 45, max = 75 } = {},
      leading: { normal = 1.5, tight = 1.125 } = {},
      values: TEXT_VALUES = limit,
    } = {},
    grid: { columns: GRID_COLUMNS = limit, ratio: GRID_RATIO = ratio } = {},
    viewport: {
      threshold = 5,
      full = 100,
      context = ["w", "h"],
      values: VIEWPORT_VALUES = limit,
    } = {},
    animation: {
      duration: { fastest = 250, slowest = 1000 } = {},
      easing: { floor = 0, ceiling = 1 } = {},
      values: ANIMATION_VALUES = limit,
    } = {},
  } = {},
} = {}) {
  const SCALE = ms_create({ ratio, values: limit }, initial);
  const [TEXT, GRID, VIEWPORT, ANIMATION] = [
    TEXT_VALUES,
    GRID_COLUMNS,
    VIEWPORT_VALUES,
    ANIMATION_VALUES,
  ].map((values) => ms_create({ ratio, values }, initial));

  const GRID_ROWS = Math.round(GRID_COLUMNS / GRID_RATIO);

  return {
    color: formula(modifiers, color),
    text: {
      family: {
        body: TextStack(BODY_FALLBACK, BODY_FAMILY),
        headings: TextStack(HEADING_FALLBACK, HEADING_FAMILY),
        code: TextStack(CODE_FALLBACK, CODE_FAMILY),
      },
      weight: {
        body: TextStyle(BODY_WEIGHTS),
        headings: TextStyle(HEADING_WEIGHTS),
        code: TextStyle(CODE_WEIGHTS),
      },
      size: TextSize(TEXT),
      measure: TextMeasure({ min, max }, TEXT),
      leading: TextLeading({ normal, tight }, TEXT),
      unit: TextUnits(TEXT),
    },
    grid: {
      columns: GRID_COLUMNS,
      rows: GRID_ROWS,
      fr: GridFractions(GRID),
      ...GridDimensions(GRID_COLUMNS, GRID_ROWS),
    },
    viewport: Viewport({ threshold, full, context }, VIEWPORT),
    animation: {
      duration: AnimationDuration({ fastest, slowest }, ANIMATION),
      easing: AnimationCubicBezier({ floor, ceiling }, ANIMATION),
    },
    ms: FigureCalculations(SCALE),
  };
}
#+END_SRC

* Formulas
:PROPERTIES:
:header-args:js: :tangle "./formulas.js" :comments link
:END:

#+BEGIN_SRC js
import { precision } from "./lib/utilities/color/index.js";
import {
  BidirectionalScale,
  NumericColorScale,
  RangedScale,
  UnidirectionalScale,
} from "./configurations.js";
import {
  color_blend,
  color_interpolation,
  color_material,
  color_shades,
  color_tints,
  color_to_hex,
  color_tones,
  ms_create,
  ms_modify,
  ms_units,
  output_systemfonts,
  utility_curry,
  utility_pipe,
} from "./utilities.js";
#+END_SRC

** Palette Formulas

#+BEGIN_SRC js
export function MaterialPalette(
  { light = 95, dark = 75, scheme = undefined, format = undefined },
  color,
) {
  return utility_pipe(
    color,
    utility_curry(paletteSettings)({ format, scheme }),
    utility_curry(generateMaterialPalette)({ light, dark }),
  );
}

function paletteSettings({ scheme, format }, color) {
  return utility_pipe(
    color,
    (color) => (format ? format(color) : color_to_hex(color)),
    (color) => (scheme ? scheme(color) : [color]),
  );
}

function generateMaterialPalette({ light, dark }, palette) {
  return utility_pipe(
    palette,
    (palette) => palette.map((color) => color_material({ light, dark }, color)),
    (palette) =>
      palette.reduce((acc, value, index) => {
        return {
          ...acc,
          [alphabeticalCategories(index)]: {
            ...value.reduce(
              (a, v, i) => ({
                ...a,
                ...(i === 0 ? { 50: v } : { [`${i}`.padEnd(3, "0")]: v }),
              }),
              {},
            ),
          },
        };
      }, {}),
  );
}

export function StandardPalette(
  {
    format = undefined,
    scheme = undefined,
    contrast = 95,
    tints = 3,
    tones = 3,
    shades = 3,
  },
  color,
) {
  return utility_pipe(
    color,
    utility_curry(paletteSettings)({ format, scheme }),
    utility_curry(structurePalette)({
      contrast,
      values: { tints, tones, shades },
    }),
  );
}

export function InterpolatedPalette(
  {
    lightness = 0,
    chroma = 0,
    hue = 0,
    values = 1,
    contrast = 95,
    tints = 3,
    tones = 3,
    shades = 3,
    format = undefined,
  },
  color,
) {
  return utility_pipe(
    format ? format(color) : color_to_hex(color),
    (color) => [
      color,
      ...(values === 1 ? [] : color_interpolation(
        { lightness, chroma, hue, values: values - 1 },
        color,
      )),
    ],
    utility_curry(structurePalette)({
      contrast,
      values: { tints, tones, shades },
    }),
  );
}

export function BlendedPalette(
  {
    values = 1,
    amount = 50,
    target = "black",
    contrast = 95,
    tints = 3,
    tones = 3,
    shades = 3,
    format = undefined,
  },
  color,
) {
  return utility_pipe(
    format ? format(color) : color_to_hex(color),
    (color) => [
      color,
      ...(values === 1
        ? []
        : color_blend({ target, amount, values: values - 1 }, color)),
    ],
    utility_curry(structurePalette)({
      contrast,
      values: { tints, tones, shades },
    }),
  );
}

function structurePalette({ contrast, values }, palette) {
  return utility_pipe(
    palette,
    (palette) =>
      palette.map((color, index) => {
        const category = alphabeticalCategories(index);
        const light = color_tints(
          {
            values: values.tints,
            amount: contrast,
          },
          color,
        );
        const muted = color_tones(
          {
            values: values.tones,
            amount: contrast / 1.27,
          },
          color,
        );
        const dark = color_shades(
          { values: values.shades, amount: contrast / 1.27 },
          color,
        );

        return [category, [color, light, muted, dark]];
      }),
    (palette) =>
      palette.reduce((acc, [key, [base, light, muted, dark]]) => {
        const variants = {
          ...(light.length ? { light: NumericColorScale(light) } : {}),
          ...(muted.length ? { muted: NumericColorScale(muted) } : {}),
          ...(dark.length ? { dark: NumericColorScale(dark) } : {}),
        };
        return {
          ...acc,
          [key]: {
            base,
            ...variants,
          },
        };
      }, {}),
  );
}

function alphabeticalCategories(index) {
  return new Map([
    ...Array(26)
      .fill(65)
      .map((v, i) => {
        const category = String.fromCharCode(v + i).toLowerCase(); // starting from "a"
        return [i, category];
      }),
  ]).get(index);
}
#+END_SRC

** Typography Formulas

#+BEGIN_SRC js
export function TextStack(fallback, font = null) {
  return font === null
    ? "".concat(output_systemfonts([fallback]))
    : [font, ...output_systemfonts([fallback])].join(", ");
}

export function TextStyle(weights) {
  return weights.reduce((acc, weight) => {
    const key = fontWeights(weight);

    return { ...acc, [key]: weight };
  }, {});
}

function fontWeights(weight) {
  return new Map([
    [100, "thin"],
    [200, "extralight"],
    [300, "light"],
    [400, "regular"],
    [500, "medium"],
    [600, "semibold"],
    [700, "bold"],
    [800, "extrabold"],
    [900, "black"],
  ]).get(weight);
}

export function TextSize(scale) {
  return Content(["rem", "em"], scale);
}

function Content([unit, inversionUnit], scale) {
  const [base] = Array.from(scale);
  const values = Array.from(scale);

  return {
    base: utility_pipe([base], utility_curry(ms_units)(unit)).toString(),
    ...BidirectionalScale(
      ["x", "d"],
      [
        ms_units(unit, values),
        utility_pipe(
          values,
          utility_curry(ms_modify)((n) => base / n),
          utility_curry(ms_units)(inversionUnit ? inversionUnit : unit),
        ),
      ],
    ),
  };
}

export function TextLeading({ normal = 1.5, tight = 1.25 }, scale) {
  const [base, ratio] = Array.from(scale);

  return Object.entries(
    ContentRange(
      {
        min: tight,
        max: normal,
        unit: "",
        keys: ["narrow", "tight"],
        calc: (n) => tight + (normal - tight) / (base * ratio ** n),
      },
      scale,
    ),
  ).reduce((acc, [key, value]) => {
    if (Array.isArray(value)) {
      return { ...acc, [key]: value.map((n) => parseFloat(n)) };
    }
    return { ...acc, [key]: parseFloat(value) };
  }, {});
}

export function TextMeasure({ min = 45, max = 75 }, scale) {
  const [base, ratio] = Array.from(scale);
  return ContentRange(
    {
      min,
      max,
      unit: "ch",
      keys: ["segment", "minimum"],
      calc: (n) => Math.trunc(min + (max - min) / (base * ratio ** n)),
    },
    scale,
  );
}

export function TextUnits(scale) {
  return Content(["ex"], scale);
}

function ContentRange({ min, max, unit, keys, calc }, scale) {
  const output = utility_curry(ms_units)(unit);

  return RangedScale(keys, [
    output([max]).toString(),
    utility_pipe(
      new Set(ms_modify(calc, scale)),
      (scale) => Array.from(scale),
      (scale) => scale.filter((n) => n > min && n < max),
      output,
    ),
    output([min]).toString(),
  ]);
}
#+END_SRC

** Layout Formulas

#+BEGIN_SRC js
export function GridFractions(scale) {
  return Content(["fr"], scale);
}

export function GridDimensions(columns, rows = columns) {
  const xs = spanCalculation(columns);
  const ys = spanCalculation(rows);

  return {
    x: xs[0],
    ...UnidirectionalScale("x", xs),
    y: xs[0],
    ...UnidirectionalScale("y", ys),
  };
}

function spanCalculation(xs) {
  return Array(xs)
    .fill(1)
    .map((x, pos) => x + pos);
}

export function FigureCalculations(scale) {
  const [base] = Array.from(scale);
  const values = Array.from(scale);

  return {
    base,
    ...UnidirectionalScale(
      "x",
      values.map((n) => precision(n)),
    ),
  };
}

export function Viewport(
  { threshold = 5, full = 100, context = ["w", "h", "min", "max"] },
  scale,
) {
  const [base, ratio] = Array.from(scale);

  return context.reduce((acc, target) => {
    const [key, unit] = viewportTargets(target);

    return {
      ...acc,
      [key]: ContentRange(
        {
          min: threshold,
          max: full,
          keys: ["segment", "threshold"],
          unit,
          calc: (n) =>
            Math.trunc(threshold + (full - threshold) / (base * ratio ** n)),
        },
        scale,
      ),
    };
  }, {});
}

function viewportTargets(target) {
  return new Map([
    ["width", ["width", "vw"]],
    ["w", ["width", "vw"]],
    ["height", ["height", "vh"]],
    ["h", ["height", "vh"]],
    ["minimum", ["min", "vmin"]],
    ["min", ["min", "vmin"]],
    ["maximum", ["max", "vmax"]],
    ["max", ["max", "vmax"]],
  ]).get(target);
}
#+END_SRC

** Animation Formulas

#+BEGIN_SRC js
export function AnimationDuration({ fastest = 250, slowest = 1000 }, scale) {
  const [base, ratio] = Array.from(scale);
  return ContentRange(
    {
      min: fastest,
      max: slowest,
      unit: "ms",
      keys: ["interval", "fastest"],
      calc: (n) => fastest + (slowest - fastest) / (base * ratio ** n),
    },
    scale,
  );
}

export function AnimationCubicBezier({ floor = 0, ceiling = 1 }, scale) {
  const [base, ratio] = Array.from(scale);
  const [maximum] = scale.slice(-1);

  const ABSCISSAS = new Set(
    ms_modify((n) => precision(n / maximum), scale).filter(
      (n) => n > 0 && n < 1,
    ),
  );

  const ORDINATES = new Set(
    ms_modify(
      (n) => precision(floor + (ceiling - floor) / (base * ratio ** n)),
      scale,
    ).filter((n) => n > floor && n < ceiling),
  );

  return {
    x: Array.from([0, ...ABSCISSAS, 1]),
    y: Array.from([floor, ...Array.from(ORDINATES).reverse(), ceiling]),
  };
}
#+END_SRC

* Configurations
:PROPERTIES:
:header-args:js: :tangle "./configurations.js" :comments link
:END:

** Numeric Color Scale

#+BEGIN_SRC js
export function NumericColorScale(data) {
  return data.reduce(
    (acc, value, index) => ({ ...acc, [`${++index}`.padEnd(3, "0")]: value }),
    {},
  );
}
#+END_SRC

