configurations.js
// [[file:Mod.org::*Numeric Color Scale][Numeric Color Scale:1]]
export function NumericColorScale(data) {
  return data.reduce(
    (acc, value, index) => ({ ...acc, [`${++index}`.padEnd(3, "0")]: value }),
    {},
  );
}
// Numeric Color Scale:1 ends here
