Mod.org
**** Parser
:PROPERTIES:
:header-args:js: :tangle "./lib/utilities/color/parser/index.js" :comments link
:END:

#+BEGIN_SRC js
import { compose, pipe } from "../../fp.js";
import { validator } from "../validator/index.js";
import { extractor } from "../extractor/index.js";
import {
  gradToDegrees,
  hexFragmentToRgb,
  hueCorrection,
  numberFromPercent,
  numberFromRgb,
  numberToDegrees,
  precision,
  radFromDegrees,
  radToDegrees,
} from "../converter/math.js";
#+END_SRC

#+BEGIN_SRC js
const FORMAT_PARSERS = {
  hex: parseHex,
  rgb: parseRGB,
  hsl: parseHSL,
  cmyk: parseCMYK,
  hwb: parseHSL, // identical to HSL
  cielab: parseCielab,
  cielch: parseCielch,
  oklab: parseOklab,
};

export const parser = compose(
  validator,
  ([format, color]) => FORMAT_PARSERS[format](color),
);
#+END_SRC

***** Format Parsers

****** Hex Parser

#+BEGIN_SRC js
function parseHex(color) {
  return pipe(
    extractor(color),
    ([format, components]) => [
      format,
      components.length === 4 ? components : [...components, "ff"],
    ],
    ([format, components]) => [
      format,
      components.map((c, pos) =>
        pos === 3
          ? pipe(c, hexFragmentToRgb, numberFromRgb)
          : hexFragmentToRgb(c)
      ),
    ],
  );
}
#+END_SRC

****** RGB Parser

#+BEGIN_SRC js
function parseRGB(color) {
  return pipe(
    extractor(color),
    ([format, components]) => [
      format,
      components.length === 4 ? components : [...components, "1"],
    ],
    ([format, components]) => [
      format,
      components.map((c, pos) =>
        c.endsWith("%")
          ? parsePercent(c)
          : pos === 3
          ? parseNumber(c)
          : parseChannel(c)
      ),
    ],
  );
}
#+END_SRC

****** HSL Parser

#+BEGIN_SRC js
function parseHSL(color) {
  return pipe(
    extractor(color),
    ([format, components]) => [
      format,
      components.length === 4 ? components : [...components, "1"],
    ],
    ([format, components]) => [
      format,
      components.map((c, pos) =>
        pos === 0
          ? parseHue(c)
          : pos === 3
          ? c.endsWith("%") ? parsePercent(c) : parseNumber(c)
          : parsePercent(c)
      ),
    ],
  );
}
#+END_SRC

****** CMYK Parser

#+BEGIN_SRC js
function parseCMYK(color) {
  return pipe(
    extractor(color),
    ([format, components]) => [
      format,
      components.length === 5 ? components : [...components, "1"],
    ],
    ([format, components]) => [
      format,
      components.map((c) => c.endsWith("%") ? parsePercent(c) : parseNumber(c)),
    ],
  );
}
#+END_SRC

****** CIELAB Parser

#+BEGIN_SRC js
function parseCielab(color) {
  return parseCie((ab) => parseNumber(ab), color);
}
#+END_SRC

****** CIELCh(ab) Parser

#+BEGIN_SRC js
function parseCielch(color) {
  return parseCie(
    (c, pos) => (pos === 2 ? parseHue(c) : parseNumber(c)),
    color,
  );
}
#+END_SRC

****** Oklab Parser

#+BEGIN_SRC js
function parseOklab(color) {
  return pipe(
    extractor(color),
    ([format, components]) => [
      format,
      components.length === 4 ? components : [...components, "1"],
    ],
    ([format, components]) => [
      format,
      components.map((c, pos) =>
        pos === 0
          ? parsePercent(c)
          : pos === 1 || pos === 3
          ? c.endsWith("%") ? parsePercent(c) : parseNumber(c)
          : parseHueAsRadians(c)
      ),
    ],
    ([format, [L, C, H, A]]) => [
      format,
      [L, C * Math.cos(H), C * Math.sin(H), A],
    ],
  );
}
#+END_SRC

***** Token Parsers

****** Number Parser

#+BEGIN_SRC js
function parseNumber(n) {
  return pipe(n, parseFloat, precision);
}
#+END_SRC

****** Percent Parser

#+BEGIN_SRC js
function parsePercent(percentage) {
  return pipe(percentage, parseFloat, numberFromPercent);
}
#+END_SRC

****** RGB Channel Parser

#+BEGIN_SRC js
function parseChannel(channel) {
  return pipe(channel, parseFloat, numberFromRgb);
}
#+END_SRC

****** Hue Parsers

#+BEGIN_SRC js
function parseHue(hue) {
  return hueCorrection(
    hue.endsWith("grad")
      ? gradToDegrees(parseFloat(hue))
      : hue.endsWith("rad")
      ? radToDegrees(parseFloat(hue))
      : hue.endsWith("turn")
      ? numberToDegrees(parseFloat(hue))
      : parseFloat(hue),
  );
}

function parseHueAsRadians(hue) {
  return hue.endsWith("rad") && !hue.endsWith("grad")
    ? parseNumber(hue)
    : pipe(hue, parseHue, radFromDegrees);
}
#+END_SRC

****** CIE* Parser

#+BEGIN_SRC js
function parseCie(unique, color) {
  return pipe(
    extractor(color),
    ([format, components]) => [
      format,
      components.length === 4 ? components : [...components, "1"],
    ],
    ([format, components]) => [
      format,
      components.map((c, pos) =>
        pos === 0
          ? parseNumber(c)
          : pos === 3
          ? c.endsWith("%") ? parsePercent(c) : parseNumber(c)
          : unique(c, pos)
      ),
    ],
  );
}
#+END_SRC

***** Output

#+BEGIN_SRC js
export function output(data) {
  return pipe(
    data,
    ([format, components]) => COLOR_ASSEMBLER(components)[format],
  );
}
#+END_SRC

#+BEGIN_SRC js
function COLOR_ASSEMBLER(components) {
  return {
    hex: hexOutput(components),
    rgb: legacyOutput("rgb", components),
    hsl: legacyOutput("hsl", components),
    cmyk: modernOutput("device-cmyk", components),
    hwb: modernOutput("hwb", components),
    cielab: modernOutput("lab", components),
    cielch: modernOutput("lch", components),
    oklab: modernOutput("oklab", components),
  };
}

function hexOutput([R, G, B, A]) {
  return "#".concat(R, G, B, A === "ff" ? "" : A);
}

function legacyOutput(prefix, [C1, C2, C3, A]) {
  return `${A === 1 ? prefix : prefix.concat("a")}(`.concat(
    (A === 1 ? [C1, C2, C3] : [C1, C2, C3, precision(parseFloat(A))]).join(
      ", ",
    ),
    ")",
  );
}

function modernOutput(prefix, components) {
  return `${prefix}(`.concat(
    components.slice(0, components.length - 1).join(" "),
    components[components.length - 1] === 1
      ? ""
      : ` / ${precision(parseFloat(components.slice(-1)))}`,
    ")",
  );
}
#+END_SRC

** Error Handling
:PROPERTIES:
:header-args:js: :tangle "./lib/error.js" :comments link
:END:

#+BEGIN_SRC js
export class QSCError extends Error {
  constructor({
    name = "Unknown Error",
    reason = "here's why",
    suggestion = "try this",
  } = {}) {
    super();
    this.name = name;
    this.message = `
${reason}
${suggestion}
${"=".repeat(80)}
`;
  }
}
#+END_SRC

** Data
:PROPERTIES:
:header-args:js: :tangle "./lib/data.js" :comments link
:END:

